{
  "aboutMe": [
    "I'm a Frontend Developer and Tester who wants to pursue a professional growth and development. I'm looking for a full-time job or an internship to enhance my skills in developing modern, responsive and interactive websites.",
    "Currently I'm studying in the Master's degree program in Artificial Intelligence Engineering, where I'm actively learning machine learning and AI.",
    "My technical skills include: HTML5, CSS3, JavaScript, TypeScript, Vue.js, Vite.js, SASS/SCSS. I also have experience with databases (PostgreSQL, Firebase) and with Jest framework. I'm familiar with using ChatGPT to improve my productivity and speed up the process of solving tasks. In addition to my technical skills, I also have experience in manual testing and creating technical documentation.",
    "I'm eager to work in a team to develop interesting projects! I'm ready to contribute to the development of your products thanks to my enthusiasm and dedication to learning new, modern technologies.",
    "My Soft-skills:"
  ],
  "extra": [
    "NOTE: This website supports 2 languages: English and Russian. If your browser's primary language is Russian, then the website will be in Russian. Otherwise, the website will be in English.",
    "To see my contact details (email, phone, social media links), click on the «Show contacts» button in the top right corner of the page.",
    "I can freely read, write and speak English."
  ],
  "filterInfo": [
    "TIP: Select a filter to find projects quicker. You can filter by programming language, technology stack or by project type (Pet-project, test assignment, big projects or layout development).",
    "IMPORTANT: Not all projects are published on GitHub Pages. These links are located in the description of the repository (in the «About» section) or in the «Deployments» section."
  ],
  "hobbies": [
    "Listening to music. I mostly listen to video game soundtracks.",
    "Learning Japanese on my free time using the Duolingo app.",
    "Playing video games from time to time.",
    "Creating UI for my projects. I like this 'creative aspect' of Frontend development.",
    "Making videos on YouTube.",
    "Walking, if the weather allows and if I have the time and motivation.",
    "Drawing, if it is possible and if I have time and motivation."
  ],
  "resumeNames": ["Frontend Developer;", "Tester (QA/Manual);", "Technical writer."],
  "serviceDesc": [
    "Creating websites that are visually appealing and function well on all devices and browsers.",
    "Manual testing, writing test scenarios. API testing using Insomnia/Postman. Writing unit tests with Jest.",
    "Creating SPA web applications, using Vue.js (Vite.js, Vue Router, i18n)."
  ],
  "serviceName": [
    "Adaptive & cross-browser web design",
    "Manual testing, API testing, writing test scenarios and unit tests",
    "Web development on Vue.js"
  ],
  "softSkills": [
    "Responsibility: I feel responsible for my actions and mistakes. I am accountable with my commitments and make an effort to meet deadlines.",
    "Ability to Focus: I'm able to concentrate and complete my tasks on time without getting sidetracked.",
    "Accepting Criticism: In my opinion, receiving and giving constructive feedback is important for personal growth.",
    "Communication Skills: I try to express my thoughts and ideas clearly so that other people can understand what I'm trying to say. For example, I can express myself clearly using text messages and other forms of text communication.",
    "Conflict-free: I have no desire to engage in any conflicts with others. However, I'm always willing to provide help when necessary.",
    "Perseverance: I am open to learning new skills, exploring technologies and gaining valuable experience in the realm of modern web development."
  ],
  "timelineItemDesc": [
    "Master's degree, majoring in «Artificial Intelligence Engineering».",
    "Bachelor's degree, majoring in «Informatics and Computer Science».",
    "School where I studied from grades 1 to 11. Graduated with a gold medal.",
    "Full-time employment as 'Central Dispatch Service Engineer' (CDS Engineer)."
  ],
  "timelineItemName": [
    "Siberian Federal University. Institute of Space and Information Technologies",
    "«Lyceum No. 10», Krasnoyarsk",
    "Sibintek LLC (Branch 'Macroregion Eastern Siberia')"
  ],
  "title": "My Portfolio"
}
