{
  "aboutMe": [
    "Я Frontend-разработчик и тестировщик, стремящийся к профессиональному росту и развитию. В настоящее время ищу возможность трудоустройства на полную занятость или прохождение стажировки, чтобы углубить свои знания и получить практический опыт создания современных, адаптивных и интерактивных веб-приложений.",
    "Сейчас обучаюсь в магистратуре по специальности «Инженерия искусственного интеллекта», где активно изучаю машинное обучение и ИИ.",
    "Мои технические навыки включают работу с HTML5, CSS3, JavaScript, TypeScript, Vue.js, Vite.js и SASS/SCSS. Имею опыт работы с базами данных (PostgreSQL, Firebase) и системой тестирования Jest. Кроме того, я использую ChatGPT для повышения производительности и ускорения процесса решения задач. Дополнительно обладаю опытом в ручном тестировании и создании технической документации.",
    "Я открыт к работе в команде над интересными проектами! Я готов внести свой вклад в развитие Ваших продуктов благодаря своему энтузиазму и стремлению осваивать новые, современные технологии.",
    "Мои качества (soft-skills):"
  ],
  "aboutMe[0]": "Я мотивированный фронтенд-разработчик и тестировщик, который заинтересован в стажировке или работе на полный рабочий день, чтобы построить карьеру и улучшить свои навыки в разработке современных, адаптивных и интерактивных веб-сайтов.",
  "extra": [
    "ПРИМЕЧАНИЕ: Данный сайт поддерживает 2 языка: английский и русский. Если основным языком Вашего браузера является русский, то сайт будет отображаться на русском. Иначе — на английском.",
    "Для того, чтобы увидеть мои контактные данные (эл. почту, телефон, ссылки на социальные сети), нажмите на кнопку «Показать контакты» в верхнем правом углу страницы.",
    "Свободно владею английским языком: могу не только читать и писать на английском, но и разговаривать."
  ],
  "filterInfo": [
    "ПРИМЕЧАНИЕ: Выберите фильтр для быстрого поиска проектов. Можно фильтровать по языкам программирования, стеку технологий или по виду проекта (Пет-проект, тестовое задание, большие проекты и вёрстка по макету).",
    "ВАЖНО: Некоторые проекты опубликованы на GitHub Pages. Такая ссылка находятся под описанием репозитория (в разделе «About») или в разделе «Deployments»."
  ],
  "hobbies": [
    "Слушать музыку. В основном я слушаю саундтреки из видеоигр.",
    "Изучать японский язык в свободное время, используя приложение «Duolingo».",
    "Играть в видеоигры время от времени.",
    "Создавать интерфейсы для разрабатываемых мной сайтов. Мне нравится эта 'творческая составляющая' в сфере Frontend разработки.",
    "Создаю видео и публикую их на своём YouTube-канале.",
    "Гулять пешком, если погода позволяет и если есть на это время и желание.",
    "Рисовать что-нибудь, если это возможно и если у меня есть время и мотивация."
  ],
  "resumeNames": [
    "Frontend-разработчик;",
    "Тестировщик (QA/Ручное тестирование);",
    "Технический писатель."
  ],
  "serviceDesc": [
    "Разработка сайтов, которые одинаково хорошо отображаются и функционируют на всех современных устройствах и браузерах.",
    "Ручное тестирование ПО, написание тестовых сценариев. Тестирование API с помощью Insomnia/Postman. Написание unit-тестов с помощью Jest.",
    "Разработка SPA веб-сайтов, используя Vue.js (Vite.js, Vue Router, i18n)."
  ],
  "serviceName": [
    "Адаптивная и кросс-браузерная верстка",
    "Ручное тестирование, тестирование API, написание тестовых сценариев и unit-тестов",
    "Разработка веб-сайтов на Vue.js"
  ],
  "softSkills": [
    "Способность брать на себя ответственность: Я способен брать на себя ответственность и признавать свои ошибки. Ответственно подхожу к дедлайнам.",
    "Способность концентрироваться: Я могу сосредоточиться на поставленных задачах и доводить их до завершения.",
    "Принятие критики: Я верю в то, что способность не только давать конструктивную критику, но и принимать её, — важная составляющая для саморазвития.",
    "Навыки коммуникации: Я стараюсь ясно выражать свои мысли и идеи, чтобы другие люди могли понять, что я пытаюсь сказать. Например, я способен ясно излагать свои мысли и идеи в письменном виде (текстовые сообщения, эл. письма и т.д.).",
    "Готовность помогать людям: Я не вступаю в конфликты с другими людьми. Более того, я всегда готов помогать другим людям, если есть такая возможность.",
    "Целеустремлённость: Я заинтересован в получении новых навыков, изучении новых технологий и получении ценного опыта в сфере современной веб-разработки."
  ],
  "timelineItemDesc": [
    "Магистратура, направление «Инженерия искусственного интеллекта».",
    "Бакалавриат, направление «Информатика и вычислительная техника». Защитил диплом на тему «Сервис автоматизированного сбора данных для систем электронной коммерции» на оценку «5».",
    "Школа, в которой я учился с 1 по 11 класс. Окончил школу с золотой медалью."
  ],
  "timelineItemName": [
    "Сибирский федеральный университет. Институт космических и информационных технологий",
    "МБОУ «Лицей № 10» г. Красноярска"
  ],
  "title": "Моё Портфолио"
}
