{
  "aboutMe": [
    "Ответственный, целеустремлённый Frontend разработчик и тестировщик, который находится в поиске полной занятости или возможности прохождения стажировки. Готов оттачивать свои профессиональные навыки и получать ценный опыт разработки современных, адаптивных и интерактивных веб-сайтов.",
    "В данный момент я прохожу обучение в магистратуре по направлению «Инженерия искусственного интеллекта», где активно изучаю машинное обучение и ИИ. У меня есть знание таких технологий, как HTML5, CSS3, JavaScript, TypeScript, Vue.js, Vite.js, scss/sass. Умею работать с PostgreSQL и Jest. Также я знаком с использованием таких инструментов как ChatGPT для улучшения продуктивности и эффективности решения проблем.",
    "Готов работать в команде и принимать участие в разработке интересных проектов! Я уверен в том, что мои энтузиазм, целеустремлённость и заинтересованность в современных технологиях будут ценной частью Вашей команды!",
    "Мои качества (soft-skills):"
  ],
  "extra": [
    "ПРИМЕЧАНИЕ: Данный сайт поддерживает 2 языка: английский и русский. Если основным языком Вашего браузера является русский, то сайт будет отображаться на русском. Иначе — на английском.",
    "Для того, чтобы увидеть мои контактные данные (эл. почту, телефон, ссылки на социальные сети), нажмите на кнопку «Показать контакты» в верхнем правом углу страницы.",
    "Свободно владею английским языком: могу не только читать и писать на английском, но и разговаривать."
  ],
  "filterInfo": [
    "ПРИМЕЧАНИЕ: Выберите фильтр для быстрого поиска проектов.",
    "Можно фильтровать по языкам программирования, стеку технологий или по виду проекта (Пет-проект, тестовое задание, большие проекты и вёрстка по макету).",
    "ВАЖНО: Некоторые проекты опубликованы на GitHub Pages. Такая ссылка находятся под описанием репозитория (в разделе «About») или в разделе «Deployments»."
  ],
  "hobbies": [
    "Слушать музыку. В основном я слушаю саундтреки из видеоигр.",
    "Изучать японский язык в свободное время, используя приложение «Duolingo».",
    "Играть в видеоигры время от времени.",
    "Создавать интерфейсы для разрабатываемых мной сайтов. Мне нравится эта 'творческая составляющая' в сфере Frontend разработки.",
    "Создаю видео и публикую их на своём YouTube-канале.",
    "Гулять пешком, если погода позволяет и если есть на это время и желание.",
    "Рисовать что-нибудь, если это возможно и если у меня есть время и мотивация."
  ],
  "resumeNames": ["Frontend разработчик;", "Тестировщик (QA/Ручное тестирование)."],
  "serviceDesc": [
    "Разработка сайтов, которые одинаково хорошо отображаются и функционируют на всех современных устройствах и браузерах.",
    "Ручное тестирование ПО, написание тестовых сценариев. Тестирование API с помощью Insomnia/Postman. Написание unit-тестов с помощью Jest.",
    "Разработка SPA веб-сайтов, используя Vue.js (Vite.js, Vue Router, i18n)."
  ],
  "serviceName": [
    "Адаптивная и кросс-браузерная верстка",
    "Ручное тестирование, тестирование API, написание тестовых сценариев и unit-тестов",
    "Разработка веб-сайтов на Vue.js"
  ],
  "softSkills": [
    "Ответственность: Я способен брать на себя ответственность и признавать свои ошибки. Ответственно подхожу к дедлайнам.",
    "Способность концентрироваться: Я могу концентрироваться на поставленных задачах и доводить их до завершения.",
    "Принятие критики: Я верю в то, что способность не только давать конструктивную критику, но и принимать её, — важная составляющая для саморазвития.",
    "Навыки коммуникации: Когда я разговариваю, я стараюсь ясно выражать свои мысли и идеи, чтобы другие люди могли понять, что я пытаюсь сказать. Например, я способен ясно излагать свои мысли и идеи в письменном виде (текстовые сообщения, эл. письма и т.д.).",
    "Готовность помогать людям: У меня нет никакой цели вступать в конфликты с другими людьми. Более того, я всегда готов помогать другим людям, если в этом есть потребность.",
    "Целеустремлённость: Я заинтересован в получении новых навыков, изучении новых технологий и получении ценного опыта в сфере современной веб-разработки."
  ],
  "timelineItemDesc": [
    "Магистратура, направление «Инженерия искусственного интеллекта».",
    "Бакалавриат, направление «Информатика и вычислительная техника». Защитил диплом на тему «Сервис автоматизированного сбора данных для систем электронной коммерции» на оценку «5».",
    "Школа, в которой я учился с 1 по 11 класс. Окончил школу с золотой медалью."
  ],
  "timelineItemName": [
    "Сибирский федеральный университет. Институт космических и информационных технологий",
    "МБОУ «Лицей № 10» г. Красноярска"
  ],
  "title": "Моё Портфолио"
}
