{
  "aboutMe": [
    "Ответственный и замотивированный Frontend разработчик и тестировщик, в поисках полной занятости или возможности прохождения стажировки. Готов оттачивать свои профессиональные навыки в создании современных, адаптивных и интерактивных веб-сайтов.",
    "В данный момент прохожу обучение в магистратуре по направлению 'Инженерия искусственного интеллекта', где активно изучаю машинное обучение и ИИ. У меня есть знание таких технологий, как HTML, CSS, JavaScript, TypeScript, Vue.js, Vite.js, scss/sass, PostgreSQL, Jest. Знаком с ChatGPT: использую его для улучшения продуктивности и для решения проблем.",
    "Я буду рад принимать участие в разработке интересных и современных проектов! Я уверен в том, что мои навыки и энтузиазм будут ценной частью дружной команды!",
    "К моим качествам (soft-skills) могу отнести следующее:"
  ],
  "extra": [
    "ПРИМЕЧАНИЕ: Данный сайт поддерживает 2 языка: английский и русский. Если основным языком Вашего браузера является русский, то сайт будет отображаться на русском. Иначе — на английском.",
    "Для того, чтобы увидеть мои контактные данные (электронную почту, телефон, ссылки на социальные сети), нажмите на кнопку 'Показать контакты' в верхнем правом углу страницы.",
    "Ссылка на сертификат на знание английского языка: https://efset.org/cert/1pK56j"
  ],
  "filterInfo": [
    "ПРИМЕЧАНИЕ: Выберите фильтр для быстрого поиска проектов.",
    "Можно фильтровать по языкам программирования, стеку технологий или по виду проекта (Пет-проект, тестовое задание, большие проекты и вёрстка по макету)."
  ],
  "hobbies": [
    "Слушать музыку. В основном я слушаю саундтреки из видеоигр.",
    "Изучать японский язык в свободное время, используя приложение 'Duolingo'.",
    "Играть в видеоигры время от времени.",
    "Создавать интерфейсы для разрабатываемых мной сайтов. Мне нравится эта 'творческая составляющая' в сфере Frontend разработки.",
    "Создаю видео и публикую их на своём YouTube-канале.",
    "Гулять пешком, если погода позволяет и если есть на это время и желание."
  ],
  "resumeNames": ["Frontend разработчик;", "Тестировщик (QA/Ручное тестирование)."],
  "serviceDesc": [
    "Разработка сайтов, которые одинаково хорошо отображаются и функционируют на всех современных устройствах и браузерах.",
    "Ручное тестирование ПО, написание тестовых сценариев. Тестирование API с помощью Insomnia/Postman. Написание unit-тестов с помощью Jest.",
    "Разработка SPA-приложений, используя Vue.js (Vite.js, Vue Router, i18n)."
  ],
  "serviceName": [
    "Адаптивная и кросс-браузерная верстка",
    "Ручное тестирование, тестирование API, написание тестовых сценариев и unit-тестов",
    "Разработка веб-сайтов на Vue.js"
  ],
  "softSkills": [
    "Ответственность. Я способен брать на себя ответственность и признавать свои ошибки. Ответственно подхожу к дедлайнам.",
    "Возможность сосредотачиваться. Я могу концентрироваться на поставленных задачах и доводить их до завершения.",
    "Принятие критики. Я верю в то, что нужно не только давать конструктивную критику, но и принимать её, чтобы улучшить эффективность работы.",
    "Навыки коммуникации. Я активно слушаю и стараюсь ясно выражать свои мысли и идеи.",
    "Адаптивность. Я настроен на изучение новых навыков и технологий."
  ],
  "timelineItemDesc": [
    "Магистратура, направление «Инженерия искусственного интеллекта».",
    "Бакалавриат, направление «Информатика и вычислительная техника». Защитил диплом на тему «Сервис автоматизированного сбора данных для систем электронной коммерции» на оценку «5».",
    "Школа, в которой я учился с 1 по 11 класс. Окончил школу с золотой медалью."
  ],
  "timelineItemName": [
    "Сибирский федеральный университет. Институт космических и информационных технологий",
    "МБОУ “Лицей № 10” г. Красноярска"
  ],
  "title": "Моё Портфолио"
}
